<a href="https://colab.research.google.com/github/ArpithMathaiPaul/Introduction-to-SQL/blob/main/Working_with_SQL_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3

 
X = sqlite3.connect('NeDB.db')
 
Y = X.cursor()

 
Y.execute('''CREATE TABLE Employee(date text, First_Name text, Last_Name text, Age real)''')

 
Y.execute("INSERT INTO Employee VALUES ('2020-01-01','John','Adam',32)")
 
X.commit()

Y.close()

In [ ]:
import sqlite3
X=sqlite3.connect('NeDB4.db')
Y=X.cursor()
Y.execute(' ' 'CREATE TABLE Employee(date text, First_Name text, Last_Name text, Age real)''')
Y.execute("INSERT INTO Employee VALUES ('2020-01-01', 'John', 'Adam',32),('2020-01-01', 'Mike', 'Joseph',30),('2020-01-01', 'Ann', 'Maria',32);")
X.commit()
Y.close()

In [ ]:
import sqlite3
conn=sqlite3.connect('NewDB1.db')
cursor=conn.cursor()
table="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)
students=[('John', '8', 'A'),
          ('Adam', '8', 'B'),
          ('Ann', '10', 'A'),]
cursor.executemany('INSERT INTO STUDENT VALUES (?,?,?)', students)
print("Data Inserted in the table: ")
data=cursor.execute('''SELECT * FROM STUDENT''')
for row in data:
        print(row)
conn.commit()
conn.close()

Data Inserted in the table:
('John', '8', 'A')
('Adam', '8', 'B')
('Ann', '10', 'A')